Repository: kostya1F634/tabularium
Catalog: lib/l10n/app_*.arb
Languages: da, hi, nl, ru, tr

source: Stop Sequences
ru: Стоп-последовательности

# stopSequencesHint
source: Comma-separated stop sequences (e.g., \n\n\n,```,---). Generation stops when encountering these. Saves tokens by stopping after JSON.
ru: Стоп-последовательности через запятую (напр. \n\n\n,```,---). Генерация останавливается при встрече. Экономит токены, останавливая после JSON.

# stopSequencesEffect
source: Saves tokens by early stopping
ru: Экономит токены ранней остановкой

# contextParameters
source: Context & Output
ru: Контекст и вывод

# samplingParameters
source: Sampling & Creativity
ru: Сэмплинг и креативность

# penaltyParameters
source: Penalties & Control
ru: Штрафы и контроль

# resetDefaults
source: Reset to Defaults
ru: Сбросить на значения по умолчанию

source: Advanced Parameters
ru: Расширенные параметры

# useIncrementalSort
source: Incremental Sort (Reliable)
ru: Инкрементная сортировка (Надежная)

# useIncrementalSortHint
source: Sort books one at a time instead of all at once. More reliable and debuggable, but slower. Recommended for large libraries or if batch sorting fails.
ru: Сортировать книги по одной вместо всех сразу. Более надежный и отлаживаемый метод, но медленнее. Рекомендуется для больших библиотек или если пакетная сортировка не работает.
