Repository: kostya1F634/tabularium
Catalog: lib/l10n/app_*.arb
Languages: da, hi, nl, ru, tr

# appSubtitle
source: Your Personal Library
da: Dit Personlige Bibliotek
hi: आपकी व्यक्तिगत लाइब्रेरी
nl: Uw Persoonlijke Bibliotheek
ru: Ваша персональная библиотека
tr: Kişisel Kütüphaneniz

source: Select Books Directory
da: Vælg Bogmappe
hi: किताबों का फ़ोल्डर चुनें
nl: Map Selecteren
ru: Выбрать директорию с книгами
tr: Kitap Klasörü Seç

source: Recent Directories
da: Seneste
hi: हाल ही के
nl: Recente
ru: Недавние директории
tr: Son Kullanılanlar

source: Favorites
da: Favoritter
hi: पसंदीदा
nl: Favorieten
ru: Избранное
tr: Favoriler

source: Clear Recent
da: Ryd Seneste
hi: हाल ही के साफ़ करें
nl: Recente Wissen
ru: Очистить недавние
tr: Son Kullanılanları Temizle

source: Clear Favorites
da: Ryd Favoritter
hi: पसंदीदा साफ़ करें
nl: Favorieten Wissen
ru: Очистить избранное
tr: Favorileri Temizle

source: Add to Favorites
da: Tilføj til Favoritter
hi: पसंदीदा में जोड़ें
nl: Aan Favorieten
ru: Добавить в избранное
tr: Favorilere Ekle

source: Remove from Favorites
da: Fjern fra Favoritter
hi: पसंदीदा से हटाएं
nl: Uit Favorieten
ru: Убрать из избранного
tr: Favorilerden Çıkar

source: Directory not found
da: Mappe ikke fundet
hi: फ़ोल्डर नहीं मिला
nl: Map niet gevonden
ru: Директория не найдена
tr: Klasör bulunamadı

# directoryNotFoundMessage
source: The directory "{path}" no longer exists or is not accessible. It has been removed from your recent directories.
da: Mappen "{path}" findes ikke eller er utilgængelig. Den er fjernet fra seneste.
hi: फ़ोल्डर "{path}" मौजूद नहीं है या पहुंच योग्य नहीं है। इसे हाल ही के से हटा दिया गया है।
nl: De map "{path}" bestaat niet meer of is niet toegankelijk. Het is verwijderd uit recente.
ru: Директория "{path}" больше не существует или недоступна. Она была удалена из списка недавних.
tr: "{path}" klasörü mevcut değil veya erişilemiyor. Son kullanılanlardan kaldırıldı.

source: Main Screen
da: Hovedskærm
hi: मुख्य स्क्रीन
nl: Hoofdscherm
ru: Главный экран
tr: Ana Ekran

source: Selected directory:
da: Valgt mappe:
hi: चयनित फ़ोल्डर:
nl: Geselecteerde map:
ru: Выбранная директория:
tr: Seçilen klasör:

source: Error
da: Fejl
hi: त्रुटि
nl: Fout
ru: Ошибка
tr: Hata

source: Error: {message}
da: Fejl: {message}
hi: त्रुटि: {message}
nl: Fout: {message}
ru: Ошибка: {message}
tr: Hata: {message}

source: Retry
da: Prøv Igen
hi: पुनः प्रयास
nl: Opnieuw
ru: Повторить
tr: Tekrar Dene

source: Loading...
da: Indlæser...
hi: लोड हो रहा है...
nl: Laden...
ru: Загрузка...
tr: Yükleniyor...

# languageEnglish
source: English
ru: Английский

# languageRussian
source: Russian
da: Русский
hi: Русский
nl: Русский
ru: Русский
tr: Русский

source: Settings
da: Indstillinger
hi: सेटिंग्स
nl: Instellingen
ru: Настройки
tr: Ayarlar

source: Language
da: Sprog
hi: भाषा
nl: Taal
ru: Язык
tr: Dil

source: All Books
da: Alle Bøger
hi: सभी किताबें
nl: Alle Boeken
ru: Все книги
tr: Tüm Kitaplar

# unsortedBooks
source: Unsorted
da: Usorteret
hi: अवर्गीकृत
nl: Ongesorteerd
ru: Без полки
tr: Sınıflandırılmamış

source: Shelves
da: Hylder
hi: शेल्फ़
nl: Planken
ru: Полки
tr: Raflar

source: Create Shelf
da: Opret Hylde
hi: शेल्फ़ बनाएं
nl: Plank Maken
ru: Создать полку
tr: Raf Oluştur

source: Edit Shelf
da: Rediger Hylde
hi: शेल्फ़ संपादित करें
nl: Plank Bewerken
ru: Редактировать полку
tr: Rafı Düzenle

source: Shelf Name
da: Hyldenavn
hi: शेल्फ़ का नाम
nl: Planknaam
ru: Название полки
tr: Raf Adı

source: Delete Shelf
da: Slet Hylde
hi: शेल्फ़ हटाएं
nl: Plank Verwijderen
ru: Удалить полку
tr: Rafı Sil

source: Open All Books
da: Åbn Alle
hi: सभी खोलें
nl: Alles Openen
ru: Открыть все книги
tr: Tümünü Aç

source: Search books...
da: Søg bøger...
hi: किताबें खोजें...
nl: Boeken zoeken...
ru: Поиск книг...
tr: Kitap ara...

source: Search shelves...
da: Søg hylder...
hi: शेल्फ़ खोजें...
nl: Planken zoeken...
ru: Поиск полок...
tr: Raf ara...

# noBooks
source: No books found
da: Ingen bøger fundet
hi: कोई किताब नहीं मिली
nl: Geen boeken gevonden
ru: Книги не найдены
tr: Kitap bulunamadı

# noBooksInShelf
source: No books in this shelf
da: Hylde er tom
hi: शेल्फ़ खाली है
nl: Plank is leeg
ru: На этой полке нет книг
tr: Raf boş

source: Scan for New Books
da: Scan Nye Bøger
hi: नई किताबें स्कैन करें
nl: Nieuwe Scannen
ru: Сканировать новые книги
tr: Yeni Kitapları Tara

source: Scan
hi: स्कैन करें
nl: Scannen
ru: Сканировать
tr: Tara

source: Initializing library...
da: Initialiserer...
hi: प्रारंभ हो रहा है...
nl: Initialiseren...
ru: Инициализация библиотеки...
tr: Başlatılıyor...

source: Loading library...
da: Indlæser...
hi: लोड हो रहा है...
nl: Laden...
ru: Загрузка библиотеки...
tr: Yükleniyor...

source: Back to Welcome
da: Tilbage
hi: वापस जाएं
nl: Terug
ru: Вернуться к приветствию
tr: Geri Dön

source: Add to Shelf
da: Tilføj til Hylde
hi: शेल्फ़ में जोड़ें
nl: Aan Plank Toevoegen
ru: Добавить на полку
tr: Rafa Ekle

source: Remove from Shelf
da: Fjern fra Hylde
hi: शेल्फ़ से हटाएं
nl: Van Plank Verwijderen
ru: Убрать с полки
tr: Raftan Çıkar

# bookCount
source: {count, plural, =0{No books} =1{1 book} other{{count} books}}
da: {count, plural, =0{Ingen bøger} =1{1 bog} other{{count} bøger}}
hi: {count, plural, =0{कोई किताब नहीं} =1{1 किताब} other{{count} किताबें}}
nl: {count, plural, =0{Geen boeken} =1{1 boek} other{{count} boeken}}
ru: {count, plural, =0{Нет книг} =1{1 книга} few{{count} книги} other{{count} книг}}
tr: {count, plural, =0{Kitap yok} =1{1 kitap} other{{count} kitap}}

source: Cancel
da: Annuller
hi: रद्द करें
nl: Annuleren
ru: Отмена
tr: İptal

source: Create
da: Opret
hi: बनाएं
nl: Maken
ru: Создать
tr: Oluştur

source: Delete
da: Slet
hi: हटाएं
nl: Verwijderen
ru: Удалить
tr: Sil

source: selected
da: valgt
hi: चयनित
nl: geselecteerd
ru: выбрано
tr: seçildi

source: Open Selected
da: Åbn Valgte
hi: चयनित खोलें
nl: Selectie Openen
ru: Открыть выбранные
tr: Seçileni Aç

source: Select All
da: Vælg Alle
hi: सभी चुनें
nl: Alles Selecteren
ru: Выбрать все
tr: Tümünü Seç

source: Clear Selection
da: Ryd Valg
hi: चयन साफ़ करें
nl: Selectie Wissen
ru: Снять выделение
tr: Seçimi Temizle

source: Delete from Shelf
da: Slet fra Hylde
hi: शेल्फ़ से हटाएं
nl: Van Plank Verwijderen
ru: Удалить из полки
tr: Raftan Sil

source: Remove
da: Fjern
hi: हटाएं
nl: Verwijderen
ru: Убрать
tr: Çıkar

source: Open
da: Åbn
hi: खोलें
nl: Openen
ru: Открыть
tr: Aç

source: Properties
da: Egenskaber
hi: गुण
nl: Eigenschappen
ru: Свойства
tr: Özellikler

source: Book Properties
da: Bogegenskaber
hi: किताब के गुण
nl: Boekeigenschappen
ru: Свойства книги
tr: Kitap Özellikleri

source: Alias
hi: उपनाम
ru: Псевдоним
tr: Takma Ad

source: File Path
da: Filsti
hi: फ़ाइल पथ
nl: Bestandspad
ru: Путь к файлу
tr: Dosya Yolu

source: Author
da: Forfatter
hi: लेखक
nl: Auteur
ru: Автор
tr: Yazar

source: Title
da: Titel
hi: शीर्षक
nl: Titel
ru: Название
tr: Başlık

# pageCount
source: Pages
da: Sider
hi: पृष्ठ
nl: Pagina's
ru: Страниц
tr: Sayfa

source: File Size
da: Filstørrelse
hi: फ़ाइल आकार
nl: Bestandsgrootte
ru: Размер файла
tr: Dosya Boyutu

source: Save
da: Gem
hi: सहेजें
nl: Opslaan
ru: Сохранить
tr: Kaydet

source: Shortcuts
da: Genveje
hi: शॉर्टकट
nl: Sneltoetsen
ru: Горячие клавиши
tr: Kısayollar

source: Keyboard Shortcuts
da: Tastaturgenveje
hi: कीबोर्ड शॉर्टकट
nl: Toetsenbordsneltoetsen
ru: Горячие клавиши
tr: Klavye Kısayolları

# deleteBook
source: Delete
da: Slet
hi: हटाएं
nl: Verwijderen
ru: Удалить
tr: Sil

source: Delete Selected
da: Slet Valgte
hi: चयनित हटाएं
nl: Selectie Verwijderen
ru: Удалить выбранные
tr: Seçileni Sil

source: Delete All
da: Slet Alle
hi: सभी हटाएं
nl: Alles Verwijderen
ru: Удалить всё
tr: Tümünü Sil

# confirmDeleteBook
source: Delete Book?
da: Slet Bog?
hi: किताब हटाएं?
nl: Boek Verwijderen?
ru: Удалить книгу?
tr: Kitap Silinsin mi?

# confirmDeleteBookMessage
source: This will permanently delete the book file from disk. This action cannot be undone.
da: Filen slettes permanent. Handling kan ikke fortrydes.
hi: फ़ाइल स्थायी रूप से हटा दी जाएगी। यह क्रिया अपरिवर्तनीय है।
nl: Het bestand wordt permanent verwijderd. Actie onomkeerbaar.
ru: Файл книги будет удалён с диска навсегда. Это действие нельзя отменить.
tr: Dosya kalıcı olarak silinecek. Bu işlem geri alınamaz.

# confirmDeleteSelected
source: Delete Selected Books?
da: Slet Valgte?
hi: चयनित हटाएं?
nl: Selectie Verwijderen?
ru: Удалить выбранные книги?
tr: Seçilenler Silinsin mi?

# confirmDeleteSelectedMessage
source: This will permanently delete {count} {count, plural, =1{book file} other{book files}} from disk. This action cannot be undone.
da: {count} {count, plural, =1{fil slettes} other{filer slettes}} permanent. Handling kan ikke fortrydes.
hi: {count} फ़ाइलें स्थायी रूप से हटा दी जाएंगी। यह क्रिया अपरिवर्तनीय है।
nl: {count} {count, plural, =1{bestand wordt} other{bestanden worden}} permanent verwijderd. Actie onomkeerbaar.
ru: {count} {count, plural, =1{файл книги} few{файла книг} other{файлов книг}} будут удалены с диска навсегда. Это действие нельзя отменить.
tr: {count} dosya kalıcı olarak silinecek. Bu işlem geri alınamaz.

# confirmDeleteAll
source: Delete All Books?
da: Slet Alle?
hi: सभी हटाएं?
nl: Alles Verwijderen?
ru: Удалить все книги?
tr: Tümü Silinsin mi?

# confirmDeleteAllMessage
source: This will permanently delete all {count} {count, plural, =1{book file} other{book files}} from this shelf from disk. This action cannot be undone.
da: Alle {count} {count, plural, =1{fil} other{filer}} fra denne hylde slettes permanent. Handling kan ikke fortrydes.
hi: इस शेल्फ़ की सभी {count} फ़ाइलें स्थायी रूप से हटा दी जाएंगी। यह क्रिया अपरिवर्तनीय है।
nl: Alle {count} {count, plural, =1{bestand} other{bestanden}} van deze plank worden permanent verwijderd. Actie onomkeerbaar.
ru: Все {count} {count, plural, =1{файл книги} few{файла книг} other{файлов книг}} с этой полки будут удалены с диска навсегда. Это действие нельзя отменить.
tr: Bu raftaki tüm {count} dosya kalıcı olarak silinecek. Bu işlem geri alınamaz.

source: About Tabularium
da: Om Tabularium
hi: Tabularium के बारे में
nl: Over Tabularium
ru: О программе Tabularium
tr: Tabularium Hakkında

source: OK
hi: ठीक है
ru: ОК
tr: Tamam

source: Toggle View Mode
da: Skift Visning
hi: दृश्य बदलें
nl: Weergave Wisselen
ru: Переключить режим просмотра
tr: Görünümü Değiştir

source: Theme
da: Tema
hi: थीम
nl: Thema
ru: Тема
tr: Tema

source: Help
da: Hjælp
hi: मदद
ru: Справка
tr: Yardım

source: About
da: Om
hi: के बारे में
nl: Over
ru: О программе
tr: Hakkında

source: Reset Settings
da: Nulstil
hi: रीसेट करें
nl: Resetten
ru: Сбросить настройки
tr: Sıfırla

source: Font Size
da: Skriftstørrelse
hi: फ़ॉन्ट आकार
nl: Lettergrootte
ru: Размер шрифта
tr: Yazı Boyutu

source: Book Scale (Grid)
da: Skala (Gitter)
hi: स्केल (ग्रिड)
nl: Schaal (Raster)
ru: Масштаб книг (Сетка)
tr: Ölçek (Izgara)

source: Book Scale (Cabinet)
da: Skala (Skab)
hi: स्केल (कैबिनेट)
nl: Schaal (Kast)
ru: Масштаб книг (Шкаф)
tr: Ölçek (Dolap)

source: Add
da: Tilføj
hi: जोड़ें
nl: Toevoegen
ru: Добавить
tr: Ekle

source: Select Shelf
da: Vælg Hylde
hi: शेल्फ़ चुनें
nl: Plank Selecteren
ru: Выбрать полку
tr: Raf Seç

# sortDateAddedNewest
source: Date Added ↓
da: Tilføjet ↓
nl: Toegevoegd ↓
ru: Дата добавления ↓
tr: Eklenme ↓

# sortDateAddedOldest
source: Date Added ↑
da: Tilføjet ↑
nl: Toegevoegd ↑
ru: Дата добавления ↑
tr: Eklenme ↑

# sortDateOpenedNewest
source: Date Opened ↓
da: Åbnet ↓
nl: Geopend ↓
ru: Дата открытия ↓
tr: Açılma ↓

# sortDateOpenedOldest
source: Date Opened ↑
da: Åbnet ↑
nl: Geopend ↑
ru: Дата открытия ↑
tr: Açılma ↑

# sortTitleAZ
source: Title A-Z
da: Titel A-Z
nl: Titel A-Z
ru: Название А-Я
tr: Başlık A-Z

# sortTitleZA
source: Title Z-A
da: Titel Z-A
nl: Titel Z-A
ru: Название Я-А
tr: Başlık Z-A

source: Search themes...
da: Søg temaer...
nl: Thema's zoeken...
ru: Поиск тем...
tr: Tema ara...

# sizeSmall
source: Small
da: Lille
nl: Klein
ru: Маленький
tr: Küçük

# sizeMedium
source: Medium
da: Mellem
nl: Gemiddeld
ru: Средний
tr: Orta

# sizeNormal
source: Normal
nl: Normaal
ru: Обычный

# sizeLarge
source: Large
da: Stor
nl: Groot
ru: Большой
tr: Büyük

# sizeExtraLarge
source: Extra Large
da: Ekstra stor
nl: Extra groot
ru: Очень большой
tr: Çok büyük

# sizeTiny
source: Tiny
da: Meget lille
nl: Zeer klein
ru: Крошечный
tr: Çok küçük

# shortcutsGeneral
source: General
da: Generelt
nl: Algemeen
ru: Общие
tr: Genel

# shortcutsNavigationShelves
source: Navigation - Shelves
da: Navigation - Hylder
nl: Navigatie - Planken
ru: Навигация - Полки
tr: Gezinti - Raflar

# shortcutsNavigationBooks
source: Navigation - Books
da: Navigation - Bøger
nl: Navigatie - Boeken
ru: Навигация - Книги
tr: Gezinti - Kitaplar

# shortcutsShelves
source: Shelves
da: Hylder
nl: Planken
ru: Полки
tr: Raflar

# shortcutsBooks
source: Books
da: Bøger
nl: Boeken
ru: Книги
tr: Kitaplar

# shortcutToggleScreen
source: Toggle between library and welcome screen
da: Skift mellem bibliotek og velkomstskærm
nl: Schakelen tussen bibliotheek en welkomstscherm
ru: Переключение между библиотекой и главным экраном
tr: Kütüphane ve hoş geldiniz ekranı arasında geçiş

# shortcutCreateShelf
source: Create new shelf
da: Opret ny hylde
nl: Nieuwe plank maken
ru: Создать новую полку
tr: Yeni raf oluştur

# shortcutOpenBooks
source: Open books (all or selected)
da: Åbn bøger (alle eller valgte)
nl: Boeken openen (alle of geselecteerd)
ru: Открыть книги (все или выбранные)
tr: Kitapları aç (tümü veya seçili)

# shortcutSelectAll
source: Select all books
da: Vælg alle
nl: Alles selecteren
ru: Выбрать все книги
tr: Tümünü seç

# shortcutClearSelection
source: Clear selection
da: Ryd valg
nl: Selectie wissen
ru: Снять выделение
tr: Seçimi temizle

# shortcutQuickShelf
source: Quick shelf selection (first 10 shelves)
da: Hurtig hyldevalg (første 10)
nl: Snelle plankselectie (eerste 10)
ru: Быстрый выбор полки (первые 10)
tr: Hızlı raf seçimi (ilk 10)

# shortcutEdit
source: Edit shelf / Book properties
da: Rediger hylde / Bogegenskaber
nl: Plank bewerken / Boekeigenschappen
ru: Редактировать полку / Свойства книги
tr: Rafı düzenle / Kitap özellikleri

# shortcutToggleView
source: Toggle view mode (Grid/Cabinet)
da: Skift visningstilstand (Gitter/Skab)
nl: Weergavemodus wisselen (Raster/Kast)
ru: Переключить вид (Сетка/Шкаф)
tr: Görünüm modunu değiştir (Izgara/Dolap)

# shortcutAddToShelf
source: Add selected/focused/all books to shelf
da: Tilføj bøger til hylde (valgte/fokuseret/alle)
nl: Boeken toevoegen aan plank (geselecteerd/focus/alle)
ru: Добавить выбранные/фокусную/все книги на полку
tr: Rafa kitap ekle (seçili/odaklanmış/tümü)

# shortcutFocusCenter
source: Focus on center visible book
da: Fokuser på central synlig bog
nl: Focus op centraal zichtbaar boek
ru: Фокус на центральной видимой книге
tr: Merkez görünür kitaba odaklan

# shortcutJumpFirst
source: Jump to first shelf/book
da: Hop til første hylde/bog
nl: Spring naar eerste plank/boek
ru: Перейти к первой полке/книге
tr: İlk rafa/kitaba atla

# shortcutJumpLast
source: Jump to last shelf/book
da: Hop til sidste hylde/bog
nl: Spring naar laatste plank/boek
ru: Перейти к последней полке/книге
tr: Son rafa/kitaba atla

# shortcutFocusSearch
source: Focus/unfocus search field
da: Fokuser/defokuser søgefelt
nl: Zoekveld focus/defocus
ru: Фокус/снять фокус с поля поиска
tr: Arama alanına odaklan/odaklanmayı kaldır

# shortcutSwitchFocus
source: Switch focus between shelves and books
da: Skift fokus mellem hylder og bøger
nl: Wissel focus tussen planken en boeken
ru: Переключить фокус между полками и книгами
tr: Raflar ve kitaplar arasında odağı değiştir

# shortcutMoveDown
source: Move down
da: Flyt ned
nl: Naar beneden
ru: Вниз
tr: Aşağı git

# shortcutMoveUp
source: Move up
da: Flyt op
nl: Naar boven
ru: Вверх
tr: Yukarı git

# shortcutMoveLeft
source: Move left
da: Flyt til venstre
nl: Naar links
ru: Влево
tr: Sola git

# shortcutMoveRight
source: Move right
da: Flyt til højre
nl: Naar rechts
ru: Вправо
tr: Sağa git

# shortcutMoveShelfDown
source: Move shelf down
da: Flyt hylde ned
nl: Plank naar beneden
ru: Переместить полку вниз
tr: Rafı aşağı taşı

# shortcutMoveShelfUp
source: Move shelf up
da: Flyt hylde op
nl: Plank naar boven
ru: Переместить полку вверх
tr: Rafı yukarı taşı

# shortcutDeleteShelf
source: Delete shelf
da: Slet hylde
nl: Plank verwijderen
ru: Удалить полку
tr: Rafı sil

# shortcutOpenFocused
source: Open focused book
da: Åbn fokuseret bog
nl: Gefocust boek openen
ru: Открыть фокусную книгу
tr: Odaklanmış kitabı aç

# shortcutToggleSelection
source: Toggle selection of focused book
da: Skift valg af fokuseret bog
nl: Selectie van gefocust boek wisselen
ru: Переключить выделение фокусной книги
tr: Odaklanmış kitabın seçimini değiştir

# shortcutRemoveFromShelf
source: Remove selected books from shelf
da: Fjern valgte bøger fra hylde
nl: Geselecteerde boeken van plank verwijderen
ru: Удалить выбранные книги с полки
tr: Seçili kitapları raftan çıkar

source: AI
ru: ИИ

source: AI Settings
ru: Настройки ИИ

# aiFullSort
source: Full Sort
ru: Полная сортировка

source: Ollama Model
ru: Модель Ollama

source: Generalization
ru: Обобщение

# generalizationHint
source: 0 = many specific shelves, 100 = few broad shelves
ru: 0 = много узких полок, 100 = мало широких полок

source: Max Pages
ru: Макс. страниц

# maxPagesHint
source: Number of pages to read per book (1-50, starting from page 2)
ru: Количество страниц для анализа книги (1-50, начиная со 2-й страницы)

source: Process Images
ru: Обрабатывать изображения

# processImagesHint
source: Include book cover thumbnail as visual context for analysis (requires vision-capable model)
ru: Использовать обложку книги как визуальный контекст для анализа (требуется модель с vision)

source: Test Connection
ru: Проверить соединение

# connectionSuccess
source: Connection successful!
ru: Соединение установлено!

source: Connection failed
ru: Ошибка соединения

# analyzeBook
source: Analyzing book
ru: Анализ книги

source: Analyzing books...
ru: Анализ книг...

source: Sorting library...
ru: Сортировка библиотеки...

source: AI sort complete
ru: Сортировка ИИ завершена

source: AI sort failed
ru: Ошибка сортировки ИИ

# booksAnalyzed
source: {count} books analyzed
ru: Проанализировано книг: {count}

# shelvesCreated
source: {count} new shelves created
ru: Создано новых полок: {count}

# aiRename
source: Auto Titling
ru: Авто-заголовки

# aiSort
source: Sort
ru: Сортировать

# aiTitle
source: AI: Title & Tags
ru: ИИ: Название и теги

source: Output Language
ru: Язык вывода

# outputLanguageHint
source: Language for shelf names, tags, and reasoning (book titles stay in original language)
ru: Язык для названий полок, тегов и размышлений (названия книг остаются на оригинальном языке)

source: Test Language
ru: Проверить язык

source: Language Test Result
ru: Результат проверки языка

source: Include Detailed Examples
ru: Включать детальные примеры

# includeDetailedExamplesHint
source: Include GOOD/BAD tag examples in prompts (reduces tokens when disabled)
ru: Включать примеры ХОРОШИХ/ПЛОХИХ тегов в запросы (уменьшает токены при отключении)

source: Include Book Reasoning
ru: Включать размышления о книгах

# includeBookReasoningHint
source: Include AI reasoning about books when sorting library (reduces tokens when disabled)
ru: Включать размышления ИИ о книгах при сортировке библиотеки (уменьшает токены при отключении)

source: Include Extended Instructions
ru: Включать расширенные инструкции

# includeExtendedInstructionsHint
source: Include validation checklists and detailed explanations in prompts (reduces tokens when disabled)
ru: Включать валидационные чеклисты и детальные объяснения в запросы (уменьшает токены при отключении)

# aiParameters
source: Parameters
ru: Параметры

source: Ollama Parameters
ru: Параметры Ollama

# numCtx
source: Context Window
ru: Контекстное окно

# numCtxHint
source: Number of tokens in context window (2048-32768). Default Ollama value is 2048, which may be too small for complex prompts. Larger values use more memory.
ru: Количество токенов в контекстном окне (2048-32768). По умолчанию в Ollama 2048, что может быть мало для сложных запросов. Большие значения требуют больше памяти.

# numCtxEffect
source: ↑ More context → Better understanding | ↓ Less context → Faster, less memory
ru: ↑ Больше контекста → Лучше понимание | ↓ Меньше → Быстрее, меньше памяти

# numPredict
source: Max Output Tokens
ru: Макс. выходных токенов

# numPredictHint
source: Maximum number of tokens to generate (128-4096, -1 for unlimited). Limits response length.
ru: Максимальное количество генерируемых токенов (128-4096, -1 без ограничений). Ограничивает длину ответа.

# numPredictEffect
source: ↑ Longer responses | ↓ Shorter responses
ru: ↑ Длиннее ответы | ↓ Короче ответы

source: Repeat Penalty
ru: Штраф за повторы

# repeatPenaltyHint
source: Penalty for repeating tokens (0.0-2.0). Higher values reduce repetition. Default: 1.1
ru: Штраф за повторяющиеся токены (0.0-2.0). Большие значения уменьшают повторения. По умолчанию: 1.1

# repeatPenaltyEffect
source: ↑ Less repetition | ↓ More repetition
ru: ↑ Меньше повторов | ↓ Больше повторов

# topKHint
source: Number of top tokens to consider (1-100). Lower values make output more focused. Default: 40
ru: Число рассматриваемых топ токенов (1-100). Меньшие значения делают вывод более фокусированным. По умолчанию: 40

# topKEffect
source: ↑ More diverse | ↓ More focused
ru: ↑ Разнообразнее | ↓ Фокуснее

# topPHint
source: Nucleus sampling threshold (0.0-1.0). Lower values make output more deterministic. Default: 0.9
ru: Порог nucleus sampling (0.0-1.0). Меньшие значения делают вывод более детерминированным. По умолчанию: 0.9

# topPEffect
source: ↑ More creative | ↓ More deterministic
ru: ↑ Креативнее | ↓ Детерминированнее

# numBatch
source: Batch Size
ru: Размер батча

# numBatchHint
source: Batch size for prompt processing (32-1024). Reduce if experiencing out-of-memory errors. Default: 512
ru: Размер батча для обработки запросов (32-1024). Уменьшите при ошибках нехватки памяти. По умолчанию: 512

# numBatchEffect
source: ↑ Faster processing | ↓ Less memory usage
ru: ↑ Быстрее обработка | ↓ Меньше памяти

source: Presence Penalty
ru: Штраф за присутствие

# presencePenaltyHint
source: Penalizes tokens that already appeared (0.0-2.0). Encourages diversity. Higher values = more variety in tags/shelves. Default: 0.0
ru: Штрафует токены, которые уже появились (0.0-2.0). Поощряет разнообразие. Большие значения = больше вариативности тегов/полок. По умолчанию: 0.0

# presencePenaltyEffect
source: ↑ More variety | ↓ May repeat
ru: ↑ Больше вариативности | ↓ Может повторяться

source: Frequency Penalty
ru: Штраф за частоту

# frequencyPenaltyHint
source: Penalizes tokens based on frequency (0.0-2.0). Reduces repetition proportionally. Default: 0.0
ru: Штрафует токены пропорционально частоте использования (0.0-2.0). Уменьшает повторы. По умолчанию: 0.0

# frequencyPenaltyEffect
source: ↑ Less frequent words | ↓ Common words OK
ru: ↑ Меньше частых слов | ↓ Обычные слова ОК

# minPHint
source: Minimum probability threshold (0.0-1.0). Alternative to Top-P. Only considers tokens with probability ≥ min_p × max_probability. Default: 0.0 (disabled)
ru: Минимальный порог вероятности (0.0-1.0). Альтернатива Top-P. Рассматривает только токены с вероятностью ≥ min_p × макс_вероятность. По умолчанию: 0.0 (выкл)

# minPEffect
source: ↑ More conservative | ↓ More diverse
ru: ↑ Консервативнее | ↓ Разнообразнее

# seed
source: Random Seed
ru: Случайное зерно

# seedHint
source: Random seed for reproducibility. Set to -1 for random generation, or fixed value (e.g., 42) for consistent results. Useful for debugging.
ru: Зерно для генератора случайных чисел. -1 для случайной генерации, или фиксированное значение (напр. 42) для воспроизводимых результатов. Полезно для отладки.

# seedEffect
source: Fixed = Reproducible | -1 = Random
ru: Фикс. = Воспроизводимо | -1 = Случайно
